Ran Plan for 7 projects:

1. project: `bootstrap-prod` dir: `terraform/bootstrap` workspace: `default`
1. project: `rds-prod` dir: `terraform/rds` workspace: `default`
1. project: `logging-prod` dir: `terraform/logging` workspace: `default`
1. project: `route53-prod` dir: `terraform/route53` workspace: `default`
1. project: `acm-prod` dir: `terraform/acm` workspace: `default`
1. project: `atlantis-prod` dir: `terraform/atlantis` workspace: `default`
1. project: `ecr-fileflow-prod` dir: `terraform/ecr/fileflow` workspace: `default`
---

### 1. project: `bootstrap-prod` dir: `terraform/bootstrap` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.aws_caller_identity.current: Reading...
data.aws_iam_openid_connect_provider.github: Reading...
data.aws_caller_identity.current: Read complete after 1s [id=646886795421]
data.aws_iam_openid_connect_provider.github: Read complete after 2s [id=arn:aws:iam::646886795421:oidc-provider/token.actions.githubusercontent.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_dynamodb_table.terraform-lock will be created
+ resource "aws_dynamodb_table" "terraform-lock" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "prod-connectly-tf-lock"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Component"   = "dynamodb"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "prod-connectly-tf-lock"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "terraform-backend"
        }
      + tags_all         = {
          + "Component"   = "dynamodb"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "prod-connectly-tf-lock"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "terraform-backend"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled                 = true
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # aws_iam_policy.github-actions-fileflow will be created
+ resource "aws_iam_policy" "github-actions-fileflow" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Permissions for deploying FileFlow infrastructure"
      + id               = (known after apply)
      + name             = "GitHubActionsFileFlowPolicy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "elasticache:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ElastiCacheManagement"
                    },
                  + {
                      + Action   = [
                          + "logs:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "CloudWatchLogsManagement"
                    },
                  + {
                      + Action   = [
                          + "s3:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "S3Management"
                    },
                  + {
                      + Action   = [
                          + "sqs:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "SQSManagement"
                    },
                  + {
                      + Action   = [
                          + "ecs:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ECSManagement"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ALBManagement"
                    },
                  + {
                      + Action   = [
                          + "ec2:*SecurityGroup*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "SecurityGroupManagement"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Component"   = "ci-cd"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "github-actions-fileflow-policy"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "terraform-backend"
        }
      + tags_all         = {
          + "Component"   = "ci-cd"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "github-actions-fileflow-policy"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "terraform-backend"
        }
    }

  # aws_iam_role.github-actions will be created
+ resource "aws_iam_role" "github-actions" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = [
                                  + "repo:ryu-qqq/Infrastructure:*",
                                  + "repo:ryu-qqq/fileflow:*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::646886795421:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for GitHub Actions workflows to deploy infrastructure"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "GitHubActionsRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Component"   = "ci-cd"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "github-actions-role"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "terraform-backend"
        }
      + tags_all              = {
          + "Component"   = "ci-cd"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "github-actions-role"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "terraform-backend"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.github-actions-kms will be created
+ resource "aws_iam_role_policy" "github-actions-kms" {
      + id          = (known after apply)
      + name        = "kms-key-access"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.github-actions-resource-management will be created
+ resource "aws_iam_role_policy" "github-actions-resource-management" {
      + id          = (known after apply)
      + name        = "resource-management"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:Describe*",
                          + "ec2:Get*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "EC2ReadOnly"
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateVpc",
                          + "ec2:DeleteVpc",
                          + "ec2:ModifyVpcAttribute",
                          + "ec2:CreateSubnet",
                          + "ec2:DeleteSubnet",
                          + "ec2:CreateInternetGateway",
                          + "ec2:DeleteInternetGateway",
                          + "ec2:AttachInternetGateway",
                          + "ec2:DetachInternetGateway",
                          + "ec2:CreateRouteTable",
                          + "ec2:DeleteRouteTable",
                          + "ec2:CreateRoute",
                          + "ec2:DeleteRoute",
                          + "ec2:AssociateRouteTable",
                          + "ec2:DisassociateRouteTable",
                          + "ec2:CreateNatGateway",
                          + "ec2:DeleteNatGateway",
                          + "ec2:AllocateAddress",
                          + "ec2:ReleaseAddress",
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "VPCManagement"
                    },
                  + {
                      + Action   = [
                          + "kms:CreateKey",
                          + "kms:CreateAlias",
                          + "kms:DeleteAlias",
                          + "kms:UpdateAlias",
                          + "kms:EnableKeyRotation",
                          + "kms:DisableKeyRotation",
                          + "kms:GetKeyRotationStatus",
                          + "kms:GetKeyPolicy",
                          + "kms:PutKeyPolicy",
                          + "kms:ScheduleKeyDeletion",
                          + "kms:CancelKeyDeletion",
                          + "kms:TagResource",
                          + "kms:UntagResource",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "KMSManagement"
                    },
                  + {
                      + Action   = [
                          + "iam:GetRole",
                          + "iam:GetRolePolicy",
                          + "iam:GetPolicy",
                          + "iam:GetPolicyVersion",
                          + "iam:ListRolePolicies",
                          + "iam:ListAttachedRolePolicies",
                          + "iam:ListPolicyVersions",
                          + "iam:ListInstanceProfilesForRole",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "IAMReadOnly"
                    },
                  + {
                      + Action   = [
                          + "iam:CreateRole",
                          + "iam:DeleteRole",
                          + "iam:UpdateRole",
                          + "iam:PutRolePolicy",
                          + "iam:DeleteRolePolicy",
                          + "iam:AttachRolePolicy",
                          + "iam:DetachRolePolicy",
                          + "iam:TagRole",
                          + "iam:UntagRole",
                          + "iam:PassRole",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:iam::646886795421:role/atlantis-*",
                          + "arn:aws:iam::646886795421:role/*-ecs-*",
                          + "arn:aws:iam::646886795421:role/*-execution-role",
                          + "arn:aws:iam::646886795421:role/*-task-role",
                        ]
                      + Sid      = "IAMManagement"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.github-actions-ssm will be created
+ resource "aws_iam_role_policy" "github-actions-ssm" {
      + id          = (known after apply)
      + name        = "ssm-parameter-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameter",
                          + "ssm:GetParameters",
                          + "ssm:PutParameter",
                          + "ssm:DeleteParameter",
                          + "ssm:AddTagsToResource",
                          + "ssm:ListTagsForResource",
                          + "ssm:RemoveTagsFromResource",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:ap-northeast-2:646886795421:parameter/shared/*"
                      + Sid      = "SSMParameterAccess"
                    },
                  + {
                      + Action   = [
                          + "ssm:DescribeParameters",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "SSMDescribe"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.github-actions-terraform-state will be created
+ resource "aws_iam_role_policy" "github-actions-terraform-state" {
      + id          = (known after apply)
      + name        = "terraform-state-access"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.github-actions-fileflow will be created
+ resource "aws_iam_role_policy_attachment" "github-actions-fileflow" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "GitHubActionsRole"
    }

  # aws_kms_alias.terraform-state will be created
+ resource "aws_kms_alias" "terraform-state" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/terraform-state"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.terraform-state will be created
+ resource "aws_kms_key" "terraform-state" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 30
      + description                        = "KMS key for Terraform state encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Component"   = "kms"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "terraform-state-encryption"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "terraform-backend"
        }
      + tags_all                           = {
          + "Component"   = "kms"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "terraform-state-encryption"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "terraform-backend"
        }
    }

  # aws_s3_bucket.terraform-state will be created
+ resource "aws_s3_bucket" "terraform-state" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "prod-connectly"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Component"   = "s3"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "prod-connectly"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "terraform-backend"
        }
      + tags_all                    = {
          + "Component"   = "s3"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "prod-connectly"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "terraform-backend"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.terraform-state will be created
+ resource "aws_s3_bucket_lifecycle_configuration" "terraform-state" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "expire-old-versions"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + filter {
                # (1 unchanged attribute hidden)
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 90
            }
        }
      + rule {
          + id     = "delete-incomplete-multipart-uploads"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + abort_incomplete_multipart_upload {
              + days_after_initiation = 7
            }

          + filter {
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_policy.terraform-state will be created
+ resource "aws_s3_bucket_policy" "terraform-state" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.terraform-state will be created
+ resource "aws_s3_bucket_public_access_block" "terraform-state" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.terraform-state will be created
+ resource "aws_s3_bucket_server_side_encryption_configuration" "terraform-state" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # aws_s3_bucket_versioning.terraform-state will be created
+ resource "aws_s3_bucket_versioning" "terraform-state" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ dynamodb_table_arn       = (known after apply)
+ dynamodb_table_name      = "prod-connectly-tf-lock"
+ github_actions_role_arn  = (known after apply)
+ github_actions_role_name = "GitHubActionsRole"
+ kms_key_alias            = "alias/terraform-state"
+ kms_key_arn              = (known after apply)
+ kms_key_id               = (known after apply)
+ s3_bucket_arn            = (known after apply)
+ s3_bucket_name           = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p bootstrap-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FInfrastructure%252Fterraform%252Fbootstrap%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p bootstrap-prod
  ```
Plan: 16 to add, 0 to change, 0 to destroy.

---
### 2. project: `rds-prod` dir: `terraform/rds` workspace: `default`
**Plan Failed**: This project is currently locked by an unapplied plan from pull #67. To continue, delete the lock from #67 or apply that plan and merge the pull request.

Once the lock is released, comment `atlantis plan` here to re-plan.

---
### 3. project: `logging-prod` dir: `terraform/logging` workspace: `default`
**Plan Failed**: This project is currently locked by an unapplied plan from pull #67. To continue, delete the lock from #67 or apply that plan and merge the pull request.

Once the lock is released, comment `atlantis plan` here to re-plan.

---
### 4. project: `route53-prod` dir: `terraform/route53` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_iam_policy_document.route53-logs-kms[0]: Reading...
data.aws_iam_policy_document.route53-logs-kms[0]: Read complete after 0s [id=1046135945]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.route53-query-logs[0] will be created
+ resource "aws_cloudwatch_log_group" "route53-query-logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/route53/set-of.com"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Component"   = "dns-logging"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "public"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "route53-query-logs-set-of.com"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "dns"
          + "Team"        = "platform-team"
        }
      + tags_all          = {
          + "Component"   = "dns-logging"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "public"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "route53-query-logs-set-of.com"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "dns"
          + "Team"        = "platform-team"
        }
    }

  # aws_kms_alias.route53-logs[0] will be created
+ resource "aws_kms_alias" "route53-logs" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/route53-logs"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.route53-logs[0] will be created
+ resource "aws_kms_key" "route53-logs" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 30
      + description                        = "KMS key for Route53 query logs encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::646886795421:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt",
                          + "kms:DescribeKey",
                          + "kms:Decrypt",
                          + "kms:CreateGrant",
                        ]
                      + Condition = {
                          + ArnLike = {
                              + "kms:EncryptionContext:aws:logs:arn" = "arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/route53/*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.ap-northeast-2.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow CloudWatch Logs"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Component"   = "kms"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "public"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "route53-logs-encryption"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "dns"
          + "Team"        = "platform-team"
        }
      + tags_all                           = {
          + "Component"   = "kms"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "public"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "route53-logs-encryption"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "dns"
          + "Team"        = "platform-team"
        }
    }

  # aws_route53_health_check.atlantis will be created
+ resource "aws_route53_health_check" "atlantis" {
      + arn               = (known after apply)
      + disabled          = false
      + enable_sni        = (known after apply)
      + failure_threshold = 3
      + fqdn              = "atlantis.set-of.com"
      + id                = (known after apply)
      + measure_latency   = false
      + port              = 443
      + request_interval  = 30
      + resource_path     = "/healthz"
      + tags              = {
          + "Component"   = "health-monitoring"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "public"
          + "Endpoint"    = "atlantis.set-of.com"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "healthcheck-atlantis-set-of.com"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "dns"
          + "Team"        = "platform-team"
        }
      + tags_all          = {
          + "Component"   = "health-monitoring"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "public"
          + "Endpoint"    = "atlantis.set-of.com"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "healthcheck-atlantis-set-of.com"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "dns"
          + "Team"        = "platform-team"
        }
      + triggers          = (known after apply)
      + type              = "HTTPS"
    }

  # aws_route53_query_log.primary[0] will be created
+ resource "aws_route53_query_log" "primary" {
      + arn                      = (known after apply)
      + cloudwatch_log_group_arn = (known after apply)
      + id                       = (known after apply)
      + zone_id                  = (known after apply)
    }

  # aws_route53_zone.primary will be created
+ resource "aws_route53_zone" "primary" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform - set-of.com DNS zone"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "set-of.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "Component"   = "route53"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "public"
          + "Domain"      = "set-of.com"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "route53-set-of.com"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "dns"
          + "Team"        = "platform-team"
        }
      + tags_all            = {
          + "Component"   = "route53"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "public"
          + "Domain"      = "set-of.com"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "route53-set-of.com"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "dns"
          + "Team"        = "platform-team"
        }
      + zone_id             = (known after apply)
    }

  # aws_ssm_parameter.hosted-zone-id will be created
+ resource "aws_ssm_parameter" "hosted-zone-id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Route53 Hosted Zone ID for set-of.com"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/shared/route53/hosted-zone-id"
      + tags           = {
          + "Component"   = "parameter-store"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "public"
          + "Environment" = "prod"
          + "Export"      = "hosted-zone-id"
          + "Lifecycle"   = "production"
          + "Name"        = "ssm-route53-zone-id"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "dns"
          + "Team"        = "platform-team"
        }
      + tags_all       = {
          + "Component"   = "parameter-store"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "public"
          + "Environment" = "prod"
          + "Export"      = "hosted-zone-id"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ssm-route53-zone-id"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "dns"
          + "Team"        = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ atlantis_health_check_id = (known after apply)
+ hosted_zone_id           = (known after apply)
+ hosted_zone_name         = "set-of.com"
+ name_servers             = (known after apply)
+ query_log_group_arn      = (known after apply)
+ query_log_group_name     = "/aws/route53/set-of.com"
+ zone_arn                 = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p route53-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FInfrastructure%252Fterraform%252Froute53%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p route53-prod
  ```
Plan: 7 to add, 0 to change, 0 to destroy.

---
### 5. project: `acm-prod` dir: `terraform/acm` workspace: `default`
**Plan Failed**: This project is currently locked by an unapplied plan from pull #67. To continue, delete the lock from #67 or apply that plan and merge the pull request.

Once the lock is released, comment `atlantis plan` here to re-plan.

---
### 6. project: `atlantis-prod` dir: `terraform/atlantis` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 init -input=false -upgrade" in "/home/atlantis/.atlantis/repos/ryu-qqq/Infrastructure/68/default/terraform/atlantis": exit status 1

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/aws v5.100.0...
╷
│ Error: Failed to install provider
│ 
│ Error while installing hashicorp/aws v5.100.0: chmod
│ .terraform/providers/registry.terraform.io/hashicorp/aws/5.100.0/linux_amd64/terraform-provider-aws_v5.100.0_x5:
│ no such file or directory
╵


```
</details>

---
### 7. project: `ecr-fileflow-prod` dir: `terraform/ecr/fileflow` workspace: `default`
**Plan Error**
```
dir "terraform/ecr/fileflow" does not exist
```

---
### Plan Summary

7 projects, 2 with changes, 0 with no changes, 5 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```